In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('NASDAQCOM.csv')

In [3]:
df.head()

         DATE NASDAQCOM
0  1971-02-05    100.00
1  1971-02-08    100.84
2  1971-02-09    100.76
3  1971-02-10    100.69
4  1971-02-11    101.45

In [4]:
from datetime import datetime

In [5]:
df['DATE']=pd.to_datetime(df['DATE'])

In [6]:
df.set_index('DATE', inplace=True)

In [7]:
df['NASDAQCOM']=df['NASDAQCOM'].str.split('.')

In [8]:
df['NASDAQCOM'].head()

DATE
1971-02-05    [100, 00]
1971-02-08    [100, 84]
1971-02-09    [100, 76]
1971-02-10    [100, 69]
1971-02-11    [101, 45]
Name: NASDAQCOM, dtype: object

In [9]:
df['NASDAQCOM']=df['NASDAQCOM'].str[0]

In [10]:
df['NASDAQCOM']=pd.to_numeric(df['NASDAQCOM'])

In [11]:
df_q=df.resample('QS').mean()

In [12]:
df.isnull().sum()

NASDAQCOM    443
dtype: int64

In [13]:
df_q.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 206 entries, 1971-01-01 to 2022-04-01
Freq: QS-JAN
Data columns (total 1 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   NASDAQCOM  206 non-null    float64
dtypes: float64(1)
memory usage: 3.2 KB

In [14]:
df_q=df_q.round(0)

In [15]:
df_q=df_q.reset_index()

In [16]:
df_q=df_q[df_q['DATE']>'2012-09-30']

In [17]:
df_q.head()

          DATE  NASDAQCOM
167 2012-10-01     3001.0
168 2013-01-01     3176.0
169 2013-04-01     3368.0
170 2013-07-01     3640.0
171 2013-10-01     3957.0

In [18]:
df_q.shape

(39, 2)

In [19]:
df3=pd.read_csv('CP.csv')

In [20]:
df3.head()

         DATE      CP
0  1947-01-01  21.970
1  1947-04-01  20.788
2  1947-07-01  20.564
3  1947-10-01  22.451
4  1948-01-01  23.739

In [21]:
df3.isnull().sum()

DATE    0
CP      0
dtype: int64

In [22]:
df3=df3[df3['DATE']>'2012-09-30']

In [23]:
df3=df3.round(0)

In [24]:
df3.head()

           DATE      CP
263  2012-10-01  1786.0
264  2013-01-01  1766.0
265  2013-04-01  1758.0
266  2013-07-01  1793.0
267  2013-10-01  1839.0

In [25]:
df3.shape

(37, 2)

In [26]:
df2=pd.read_csv('GDP (1).csv')

In [27]:
df2.head()

         DATE      GDP
0  1947-01-01  243.164
1  1947-04-01  245.968
2  1947-07-01  249.585
3  1947-10-01  259.745
4  1948-01-01  265.742

In [28]:
df2.isnull().sum()

DATE    0
GDP     0
dtype: int64

In [29]:
df2=df2[df2['DATE']>'2012-09-30']

In [30]:
df2=df2.round(0)

In [31]:
df2.head()

           DATE      GDP
263  2012-10-01  16420.0
264  2013-01-01  16629.0
265  2013-04-01  16700.0
266  2013-07-01  16911.0
267  2013-10-01  17133.0

In [32]:
df1=pd.read_csv('WALCL.csv')

In [33]:
df1['DATE']=pd.to_datetime(df1['DATE'])

In [34]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1010 entries, 0 to 1009
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   DATE    1010 non-null   datetime64[ns]
 1   WALCL   1010 non-null   float64
dtypes: datetime64[ns](1), float64(1)
memory usage: 15.9 KB

In [35]:
df1.set_index('DATE', inplace=True)

In [36]:
df1q=df1.resample('QS').mean()

In [37]:
df1.isnull().sum()

WALCL    0
dtype: int64

In [38]:
df1q=df1q.reset_index()

In [39]:
df1q=df1q.round(0)

In [40]:
df1q.head()

        DATE     WALCL
0 2002-10-01  725800.0
1 2003-01-01  723346.0
2 2003-04-01  737916.0
3 2003-07-01  741690.0
4 2003-10-01  751828.0

In [41]:
df1q.shape

(79, 2)

In [42]:
df23=pd.merge(df2,df3)

In [43]:
df23.head()

         DATE      GDP      CP
0  2012-10-01  16420.0  1786.0
1  2013-01-01  16629.0  1766.0
2  2013-04-01  16700.0  1758.0
3  2013-07-01  16911.0  1793.0
4  2013-10-01  17133.0  1839.0

In [44]:
df23['DATE']=pd.to_datetime(df23['DATE'])

In [45]:
df24=pd.merge(df23,df_q)

In [46]:
df24.head()

        DATE      GDP      CP  NASDAQCOM
0 2012-10-01  16420.0  1786.0     3001.0
1 2013-01-01  16629.0  1766.0     3176.0
2 2013-04-01  16700.0  1758.0     3368.0
3 2013-07-01  16911.0  1793.0     3640.0
4 2013-10-01  17133.0  1839.0     3957.0

In [47]:
df24.shape

(37, 4)

In [48]:
df24.corr()

                GDP        CP  NASDAQCOM
GDP        1.000000  0.755995   0.926398
CP         0.755995  1.000000   0.856102
NASDAQCOM  0.926398  0.856102   1.000000

In [49]:
df25=pd.merge(df24,df1q)

In [50]:
df25.head()

        DATE      GDP      CP  NASDAQCOM      WALCL
0 2012-10-01  16420.0  1786.0     3001.0  2858947.0
1 2013-01-01  16629.0  1766.0     3176.0  3060648.0
2 2013-04-01  16700.0  1758.0     3368.0  3353623.0
3 2013-07-01  16911.0  1793.0     3640.0  3613485.0
4 2013-10-01  17133.0  1839.0     3957.0  3889295.0

In [51]:
df25.corr()

                GDP        CP  NASDAQCOM     WALCL
GDP        1.000000  0.755995   0.926398  0.693463
CP         0.755995  1.000000   0.856102  0.783715
NASDAQCOM  0.926398  0.856102   1.000000  0.890090
WALCL      0.693463  0.783715   0.890090  1.000000

In [52]:
df25.shape

(37, 5)

In [53]:
X=df25[['GDP','CP','WALCL']]

In [54]:
y=df25['NASDAQCOM']

In [55]:
import statsmodels
import statsmodels.api as sm
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler

In [56]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler(feature_range = (0,1))

In [57]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=.20, random_state=1)

In [58]:
scaler.fit(X_train)
X_train = scaler.fit_transform(X_train)
X_test = scaler.transform(X_test)

In [59]:
lr=LinearRegression()
lr.fit(X,y)

LinearRegression()

In [ ]:
lr_pred=lr.predict(X_test)

In [61]:
lr.score(X,y)

0.9797944303307612

In [62]:
X = sm.add_constant(X) # adding a constant

model = sm.OLS(y, X).fit()
predictions = model.predict(X) 

print(model.summary())

                            OLS Regression Results
==============================================================================
Dep. Variable:              NASDAQCOM   R-squared:                       0.980
Model:                            OLS   Adj. R-squared:                  0.978
Method:                 Least Squares   F-statistic:                     533.4
Date:                Sat, 30 Apr 2022   Prob (F-statistic):           5.09e-28
Time:                        10:31:13   Log-Likelihood:                -279.95
No. Observations:                  37   AIC:                             567.9
Df Residuals:                      33   BIC:                             574.3
Df Model:                           3
Covariance Type:            nonrobust
==============================================================================
                 coef    std err          t      P>|t|      [0.025      0.975]
------------------------------------------------------------------------------
const      -1.819e+04    927.631    -19.614      0.000   -2.01e+04   -1.63e+04
GDP            0.9218      0.065     14.138      0.000       0.789       1.054
CP             1.2963      0.549      2.363      0.024       0.180       2.412
WALCL          0.0010   9.42e-05     10.301      0.000       0.001       0.001
==============================================================================
Omnibus:                        2.765   Durbin-Watson:                   0.535
Prob(Omnibus):                  0.251   Jarque-Bera (JB):                2.034
Skew:                           0.403   Prob(JB):                        0.362
Kurtosis:                       2.182   Cond. No.                     5.73e+07
==============================================================================

Notes:
[1] Standard Errors assume that the covariance matrix of the errors is correctly specified.
[2] The condition number is large, 5.73e+07. This might indicate that there are
strong multicollinearity or other numerical problems.

In [63]:
from sklearn.preprocessing import PolynomialFeatures
from sklearn import linear_model

poly = PolynomialFeatures(degree=5, interaction_only=True)
X_train5 = poly.fit_transform(X_train)
X_test5 = poly.fit_transform(X_test)

poly_clf = linear_model.LinearRegression()

poly_clf.fit(X_train5, y_train)

y_pred = poly_clf.predict(X_test5)

print(poly_clf.score(X_train5, y_train))

0.9946800859263429

In [64]:
df25.head()

        DATE      GDP      CP  NASDAQCOM      WALCL
0 2012-10-01  16420.0  1786.0     3001.0  2858947.0
1 2013-01-01  16629.0  1766.0     3176.0  3060648.0
2 2013-04-01  16700.0  1758.0     3368.0  3353623.0
3 2013-07-01  16911.0  1793.0     3640.0  3613485.0
4 2013-10-01  17133.0  1839.0     3957.0  3889295.0

In [65]:
df25['open']=df24['NASDAQCOM'].shift()

In [66]:
df25['diff']=df24['NASDAQCOM']-df25['open']

In [67]:
df25.head()

        DATE      GDP      CP  NASDAQCOM      WALCL    open   diff
0 2012-10-01  16420.0  1786.0     3001.0  2858947.0     NaN    NaN
1 2013-01-01  16629.0  1766.0     3176.0  3060648.0  3001.0  175.0
2 2013-04-01  16700.0  1758.0     3368.0  3353623.0  3176.0  192.0
3 2013-07-01  16911.0  1793.0     3640.0  3613485.0  3368.0  272.0
4 2013-10-01  17133.0  1839.0     3957.0  3889295.0  3640.0  317.0

In [68]:
df25.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 37 entries, 0 to 36
Data columns (total 7 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   DATE       37 non-null     datetime64[ns]
 1   GDP        37 non-null     float64
 2   CP         37 non-null     float64
 3   NASDAQCOM  37 non-null     float64
 4   WALCL      37 non-null     float64
 5   open       36 non-null     float64
 6   diff       36 non-null     float64
dtypes: datetime64[ns](1), float64(6)
memory usage: 2.3 KB

In [74]:
def Getup(no):
    if no>0:
        return "up"
    elif no<=0:
        return "down"
    else:
        return "other"

In [75]:
df25['up-down'] = df25['diff'].apply(lambda x: Getup(x))

In [76]:
df25

         DATE      GDP      CP  NASDAQCOM      WALCL     open    diff up-down
0  2012-10-01  16420.0  1786.0     3001.0  2858947.0      NaN     NaN   other
1  2013-01-01  16629.0  1766.0     3176.0  3060648.0   3001.0   175.0      up
2  2013-04-01  16700.0  1758.0     3368.0  3353623.0   3176.0   192.0      up
3  2013-07-01  16911.0  1793.0     3640.0  3613485.0   3368.0   272.0      up
4  2013-10-01  17133.0  1839.0     3957.0  3889295.0   3640.0   317.0      up
5  2014-01-01  17144.0  1768.0     4210.0  4127964.0   3957.0   253.0      up
6  2014-04-01  17463.0  1865.0     4195.0  4311948.0   4210.0   -15.0    down
7  2014-07-01  17743.0  1918.0     4482.0  4414642.0   4195.0   287.0      up
8  2014-10-01  17853.0  1879.0     4600.0  4484785.0   4482.0   118.0      up
9  2015-01-01  17991.0  1771.0     4825.0  4497297.0   4600.0   225.0      up
10 2015-04-01  18194.0  1789.0     5030.0  4480482.0   4825.0   205.0      up
11 2015-07-01  18307.0  1732.0     4924.0  4485814.0   5030.0  -106.0    down
12 2015-10-01  18332.0  1635.0     4998.0  4489102.0   4924.0    74.0      up
13 2016-01-01  18425.0  1697.0     4614.0  4486484.0   4998.0  -384.0    down
14 2016-04-01  18612.0  1758.0     4845.0  4475798.0   4614.0   231.0      up
15 2016-07-01  18775.0  1754.0     5168.0  4468330.0   4845.0   323.0      up
16 2016-10-01  18968.0  1823.0     5309.0  4457911.0   5168.0   141.0      up
17 2017-01-01  19154.0  1911.0     5736.0  4460615.0   5309.0   427.0      up
18 2017-04-01  19323.0  1896.0     6095.0  4471341.0   5736.0   359.0      up
19 2017-07-01  19559.0  1948.0     6343.0  4463849.0   6095.0   248.0      up
20 2017-10-01  19883.0  1775.0     6758.0  4452972.0   6343.0   415.0      up
21 2018-01-01  20144.0  1947.0     7253.0  4418993.0   6758.0   495.0      up
22 2018-04-01  20492.0  1972.0     7355.0  4346987.0   7253.0   102.0      up
23 2018-07-01  20659.0  1986.0     7874.0  4243144.0   7355.0   519.0      up
24 2018-10-01  20813.0  2005.0     7215.0  4128102.0   7874.0  -659.0    down
25 2019-01-01  21002.0  1937.0     7343.0  4009351.0   7215.0   128.0      up
26 2019-04-01  21289.0  1986.0     7876.0  3881489.0   7343.0   533.0      up
27 2019-07-01  21505.0  1923.0     8067.0  3795758.0   7876.0   191.0      up
28 2019-10-01  21694.0  1964.0     8445.0  4037312.0   8067.0   378.0      up
29 2020-01-01  21481.0  1743.0     8771.0  4304006.0   8445.0   326.0      up
30 2020-04-01  19477.0  1578.0     9091.0  6753313.0   8771.0   320.0      up
31 2020-07-01  21139.0  2148.0    10926.0  6996256.0   9091.0  1835.0      up
32 2020-10-01  21478.0  2164.0    11954.0  7225935.0  10926.0  1028.0      up
33 2021-01-01  22038.0  2368.0    13351.0  7517579.0  11954.0  1397.0      up
34 2021-04-01  22741.0  2690.0    13847.0  7900327.0  13351.0   496.0      up
35 2021-07-01  23202.0  2722.0    14839.0  8309389.0  13847.0   992.0      up
36 2021-10-01  24003.0  2700.0    15390.0  8636952.0  14839.0   551.0      up

In [77]:
df25['up-down'].value_counts()

up       32
down      4
other     1
Name: up-down, dtype: int64

In [78]:
df26=df25[1:]

In [79]:
df26

         DATE      GDP      CP  NASDAQCOM      WALCL     open    diff up-down
1  2013-01-01  16629.0  1766.0     3176.0  3060648.0   3001.0   175.0      up
2  2013-04-01  16700.0  1758.0     3368.0  3353623.0   3176.0   192.0      up
3  2013-07-01  16911.0  1793.0     3640.0  3613485.0   3368.0   272.0      up
4  2013-10-01  17133.0  1839.0     3957.0  3889295.0   3640.0   317.0      up
5  2014-01-01  17144.0  1768.0     4210.0  4127964.0   3957.0   253.0      up
6  2014-04-01  17463.0  1865.0     4195.0  4311948.0   4210.0   -15.0    down
7  2014-07-01  17743.0  1918.0     4482.0  4414642.0   4195.0   287.0      up
8  2014-10-01  17853.0  1879.0     4600.0  4484785.0   4482.0   118.0      up
9  2015-01-01  17991.0  1771.0     4825.0  4497297.0   4600.0   225.0      up
10 2015-04-01  18194.0  1789.0     5030.0  4480482.0   4825.0   205.0      up
11 2015-07-01  18307.0  1732.0     4924.0  4485814.0   5030.0  -106.0    down
12 2015-10-01  18332.0  1635.0     4998.0  4489102.0   4924.0    74.0      up
13 2016-01-01  18425.0  1697.0     4614.0  4486484.0   4998.0  -384.0    down
14 2016-04-01  18612.0  1758.0     4845.0  4475798.0   4614.0   231.0      up
15 2016-07-01  18775.0  1754.0     5168.0  4468330.0   4845.0   323.0      up
16 2016-10-01  18968.0  1823.0     5309.0  4457911.0   5168.0   141.0      up
17 2017-01-01  19154.0  1911.0     5736.0  4460615.0   5309.0   427.0      up
18 2017-04-01  19323.0  1896.0     6095.0  4471341.0   5736.0   359.0      up
19 2017-07-01  19559.0  1948.0     6343.0  4463849.0   6095.0   248.0      up
20 2017-10-01  19883.0  1775.0     6758.0  4452972.0   6343.0   415.0      up
21 2018-01-01  20144.0  1947.0     7253.0  4418993.0   6758.0   495.0      up
22 2018-04-01  20492.0  1972.0     7355.0  4346987.0   7253.0   102.0      up
23 2018-07-01  20659.0  1986.0     7874.0  4243144.0   7355.0   519.0      up
24 2018-10-01  20813.0  2005.0     7215.0  4128102.0   7874.0  -659.0    down
25 2019-01-01  21002.0  1937.0     7343.0  4009351.0   7215.0   128.0      up
26 2019-04-01  21289.0  1986.0     7876.0  3881489.0   7343.0   533.0      up
27 2019-07-01  21505.0  1923.0     8067.0  3795758.0   7876.0   191.0      up
28 2019-10-01  21694.0  1964.0     8445.0  4037312.0   8067.0   378.0      up
29 2020-01-01  21481.0  1743.0     8771.0  4304006.0   8445.0   326.0      up
30 2020-04-01  19477.0  1578.0     9091.0  6753313.0   8771.0   320.0      up
31 2020-07-01  21139.0  2148.0    10926.0  6996256.0   9091.0  1835.0      up
32 2020-10-01  21478.0  2164.0    11954.0  7225935.0  10926.0  1028.0      up
33 2021-01-01  22038.0  2368.0    13351.0  7517579.0  11954.0  1397.0      up
34 2021-04-01  22741.0  2690.0    13847.0  7900327.0  13351.0   496.0      up
35 2021-07-01  23202.0  2722.0    14839.0  8309389.0  13847.0   992.0      up
36 2021-10-01  24003.0  2700.0    15390.0  8636952.0  14839.0   551.0      up

In [80]:
X=df26[['CP','GDP']]
y=df26['up-down']

In [81]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler(feature_range = (0,1))

In [82]:
from sklearn import datasets
from sklearn.metrics import confusion_matrix
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler
from sklearn.pipeline import Pipeline
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score
from sklearn.metrics import accuracy_score,precision_score,recall_score,f1_score
from sklearn.metrics import confusion_matrix, classification_report

In [83]:
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=.20, random_state=1,stratify=y)

In [84]:
scaler.fit(X_train)
X_train = scaler.fit_transform(X_train)
X_test = scaler.transform(X_test)

In [85]:
rfc=RandomForestClassifier(n_estimators=200)

In [86]:
rfc.fit(X_train,y_train)

RandomForestClassifier(n_estimators=200)

In [87]:
rfc_pred=rfc.predict(X_test)

In [88]:
print(classification_report(y_test,rfc_pred))

              precision    recall  f1-score   support

        down       0.00      0.00      0.00         1
          up       0.86      0.86      0.86         7

    accuracy                           0.75         8
   macro avg       0.43      0.43      0.43         8
weighted avg       0.75      0.75      0.75         8

In [89]:
confusion_matrix(y_test,rfc_pred)

array([[0, 1],
       [1, 6]], dtype=int64)

In [90]:
from sklearn.linear_model import LogisticRegression
from sklearn.model_selection import GridSearchCV

In [91]:
param_grid_lr = {
    'max_iter': [20, 50, 100, 200, 500, 1000],                      
    'solver': ['newton-cg', 'lbfgs', 'liblinear', 'sag', 'saga'],   
    'class_weight': ['balanced']                                    
}

In [92]:
lr=LogisticRegression()

In [93]:
grid_search = GridSearchCV(estimator = lr, param_grid = param_grid_lr, 
                          cv = 3, n_jobs = -1, verbose = 2)

In [ ]:
grid_search.fit(X_train,y_train)

In [95]:
print(grid_search.best_estimator_)

LogisticRegression(class_weight='balanced', max_iter=20, solver='saga')

In [96]:
lr_pred=grid_search.predict(X_test)

In [97]:
print(classification_report(y_test,lr_pred))

              precision    recall  f1-score   support

        down       0.20      1.00      0.33         1
          up       1.00      0.43      0.60         7

    accuracy                           0.50         8
   macro avg       0.60      0.71      0.47         8
weighted avg       0.90      0.50      0.57         8